[
  {
    "title": "Lonesome Dove",
    "author": "Larry McMurtry",
    "description": "Chronicles a cattle drive in the nineteenth century from Texas to Montana, and follows the lives of Gus and Call, the cowboys heading the drive, Gus's woman, Lorena, and Blue Duck, a sinister Indian renegade.",
    "image_url": "http://books.google.com/books/content?id=GXYH1C_esq0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "isbn": "ISBN_13 9781439195260"
  },
  {
    "title": "The killer angels",
    "author": "Michael Shaara",
    "description": "Portraits of Lee, Longstreet, and other Civil War leaders are interwoven with historical detail to provide a fictional recreation of the bloody battle at Gettysburg",
    "isbn": "ISBN_13 9780345348104",
    "image_url": "http://books.google.com/books/content?id=5HskSLGlL_cC&printsec=frontcover&img=1&zoom=1&source=gbs_api"
  },
  {
    "title": "The Stone Diaries",
    "author": "Carol Shields",
    "description": "Born in 1905, Daisy Goodwill drifts through the chapters of childhood, marriage, widowhood, remarriage, motherhood and old age. Bewildered by her inability to understand her own role, Daisy attempts to find a way to tell her own story within a novel that is itself about the limitations of autobiography.",
    "isbn": "ISBN_13 9789462380851",
    "image_url": "http://books.google.com/books/content?id=zd1JjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
  },
  {
    "title": "Undaunted Courage",
    "author": "Stephen E. Ambrose",
    "description": "From the New York Times bestselling author of Band of Brothers and D-Day, the definitive book on Lewis and Clark’s exploration of the Louisiana Purchase, the most momentous expedition in American history and one of the great adventure stories of all time. In 1803 President Thomas Jefferson selected his personal secretary, Captain Meriwether Lewis, to lead a voyage up the Missouri River to the Rockies, over the mountains, down the Columbia River to the Pacific Ocean, and back. Lewis and his partner, Captain William Clark, made the first map of the trans-Mississippi West, provided invaluable scientific data on the flora and fauna of the Louisiana Purchase territory, and established the American claim to Oregon, Washington, and Idaho. Ambrose has pieced together previously unknown information about weather, terrain, and medical knowledge at the time to provide a vivid backdrop for the expedition. Lewis is supported by a rich variety of colorful characters, first of all Jefferson himself, whose interest in exploring and acquiring the American West went back thirty years. Next comes Clark, a rugged frontiersman whose love for Lewis matched Jefferson’s. There are numerous Indian chiefs, and Sacagawea, the Indian girl who accompanied the expedition, along with the French-Indian hunter Drouillard, the great naturalists of Philadelphia, the French and Spanish fur traders of St. Louis, John Quincy Adams, and many more leading political, scientific, and military figures of the turn of the century. High adventure, high politics, suspense, drama, and diplomacy combine with high romance and personal tragedy to make this outstanding work of scholarship as readable as a novel.",
    "isbn": "ISBN_13 9781439126172",
    "image_url": "http://books.google.com/books/content?id=-fbFHCxSv2EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "Lincoln",
    "author": "David Herbert Donald",
    "description": "A masterful work by Pulitzer Prize–winning author David Herbert Donald, Lincoln is a stunning portrait of Abraham Lincoln’s life and presidency. Donald brilliantly depicts Lincoln’s gradual ascent from humble beginnings in rural Kentucky to the ever-expanding political circles in Illinois, and finally to the presidency of a country divided by civil war. Donald goes beyond biography, illuminating the gradual development of Lincoln’s character, chronicling his tremendous capacity for evolution and growth, thus illustrating what made it possible for a man so inexperienced and so unprepared for the presidency to become a great moral leader. In the most troubled of times, here was a man who led the country out of slavery and preserved a shattered Union—in short, one of the greatest presidents this country has ever seen.",
    "isbn": "ISBN_13 9781439126288",
    "image_url": "http://books.google.com/books/content?id=lTQSlhUUEOQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "Red Sparrow",
    "author": "Jason Matthews",
    "description": "Drafted against her will to serve the regime of Vladimir Putin as an intelligence seductress, Dominika Egorova engages in a charged effort of deception and tradecraft with first-tour CIA officer Nathaniel Nash before a forbidden attraction threatens their careers.",
    "isbn": "ISBN_13 9781476764177",
    "image_url": "http://books.google.com/books/content?id=l-lnAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "The Name of the Wind",
    "author": "Patrick Rothfuss",
    "isbn": "ISBN_13 9781473224087",
    "image_url": "http://books.google.com/books/content?id=jv5ktAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "Deep below the University, there is a dark place. Few people know of it: a broken web of ancient passageways and abandoned rooms. A young woman lives there, tucked among the sprawling tunnels of the Underthing, snug in the heart of this forgotten place. Her name is Auri, and she is full of mysteries. The Slow Regard of Silent Things is a brief, bittersweet glimpse of Auri's life, a small adventure all her own. At once joyous and haunting, this story offers a chance to see the world through Auri's eyes. And it gives the reader a chance to learn things that only Auri knows.... In this book, Patrick Rothfuss brings us into the world of one of The Kingkiller Chronicle's most enigmatic characters. Full of secrets and mysteries, The Slow Regard of Silent Things is the story of a broken girl trying to live in a broken world."
  },
  {
    "title": "A Clockwork Orange (Restored Text)",
    "author": "Anthony Burgess",
    "isbn": "ISBN_13 9780393239195",
    "image_url": "http://books.google.com/books/content?id=fVnqpwphxeAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A newly revised text for A Clockwork Orange's 50th anniversary brings the work closest to its author's intentions. A Clockwork Orange is as brilliant, transgressive, and influential as when it was published fifty years ago. A nightmare vision of the future told in its own fantastically inventive lexicon, it has since become a classic of modern literature and the basis for Stanley Kubrick's once-banned film, whose recent reissue has brought this revolutionary tale on modern civilization to an even wider audience. Andrew Biswell, PhD, director of the International Burgess Foundation, has taken a close look at the three varying published editions alongside the original typescript to recreate the novel as Anthony Burgess envisioned it. We publish this landmark edition with its original British cover and six of Burgess's own illustrations."
  },
  {
    "title": "East of Eden",
    "author": "John Steinbeck",
    "isbn": "ISBN_13 9781440631320",
    "image_url": "http://books.google.com/books/content?id=OPy6E5ZhXs0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A masterpiece of Biblical scope, and the magnum opus of one of America's most enduring authors, in a commemorative hardcover edition In his journal, Nobel Prize winner John Steinbeck called East of Eden \"the first book,\" and indeed it has the primordial power and simplicity of myth. Set in the rich farmland of California's Salinas Valley, this sprawling and often brutal novel follows the intertwined destinies of two families—the Trasks and the Hamiltons—whose generations helplessly reenact the fall of Adam and Eve and the poisonous rivalry of Cain and Abel. The masterpiece of Steinbeck's later years, East of Eden is a work in which Steinbeck created his most mesmerizing characters and explored his most enduring themes: the mystery of identity, the inexplicability of love, and the murderous consequences of love's absence. Adapted for the 1955 film directed by Elia Kazan introducing James Dean, and read by thousands as the book that brought Oprah's Book Club back, East of Eden has remained vitally present in American culture for over half a century."
  },
  {
    "title": "The Mambo Kings Play Songs of Love",
    "author": "Oscar Hijuelos",
    "description": "It's 1949 and two young Cuban musicians make their way up from Havana to the big arena of New York, where they are workers by day, stars of dance halls by night. Hijuelos's marvelous portrait of the Castillo brothers, their families, their fellow musicians and lovers, their triumphs and tragedies, re-creates the sights and sounds of an era in music and an unsung moment in American life.",
    "isbn": "UOM:39015066045520",
    "image_url": "http://books.google.com/books/content?id=0x1gAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
  },
  {
    "title": "The Travels of Jaimie McPheeters",
    "author": "Robert Lewis Taylor",
    "isbn": "ISBN_13 9780739477861",
    "description": "With more than one million copies in print since its first publication in 1959, this Pulitzer Prize-winning classic details the journey of 13-year-old Jaimie and his father from Kentucky to gold-rush California in 1849.",
    "image_url": "http://books.google.com/books/content?id=Kv3aC8aVM9YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "Cadillac Jack",
    "author": "Larry McMurtry",
    "description": "In Cadillac Jack, Larry McMurtry -- Pulitzer Prize-winning author of Lonesome Dove -- proves his unique talent for conjuring up the real, often eccentric people who inhabit the American heartland and for capturing the peculiarly American search for new frontiers and adventure. Cadillac Jack is a rodeo-cowboy-turned-antique-scout whose nomadic, womanizing life -- centered on his classic pearl-colored Cadillac -- rambles between the Texas flatlands of flea markets and small-time auctions and Washington, D.C.'s political-social life of parties, hustlers, vixens, and spies. Along the way he meets a cast of indelibly etched characters: among them, the strikingly beautiful, social-climbing Cindy Sanders; Boog Miller, the tackily-dressing millionaire good ole boy who patronizes Jack's business and who has more political muscle than a litter of lobbyists; Khaki Descartes, the pushy, brain-picking, Washington woman reporter; Freddy Fu, an undercover CIA agent working out of a greasy barbecue joint called The Cover-Up; and Jean Arber, the mother of two and a fledgling antique-store owner who can't quite figure out if she'll marry Jack or not. Wild, touching, and hilariously funny, Cadillac Jack is Larry McMurtry's raucous social satire of sex, politics, and love in the fast lane, peopled with Americans only he could render.",
    "isbn": "ISBN_13 9781439129005",
    "image_url": "http://books.google.com/books/content?id=HAF7y98xzesC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "Leaving Cheyenne",
    "author": "Larry McMurtry",
    "description": "An unforgettable tale of a love triangle that spans a generation, of a friendship that endures from dusty wagons to private planes, and of a rancher's legacy that sprawls beyond memories and land. \"A rarity . . . funny, wonderful, heartbreaking, exhilarating\".--New York Times Book Review. McMurtry is the Pulitzer Prize-winning author of Lonesome Dove.",
    "isbn": "ISBN_13 9780671753801",
    "image_url": "http://books.google.com/books/content?id=F5vSK8n04lkC&printsec=frontcover&img=1&zoom=1&source=gbs_api"
  },
  {
    "title": "Thalia: A Texas Trilogy",
    "author": "Larry McMurtry",
    "description": "The renaissance of Larry McMurtry, “an alchemist who converts the basest materials to gold” (New York Times Book Review), continues with the publication of Thalia. Larry McMurtry burst onto the American literary scene with a force that would forever redefine how we perceive the American West. His first three novels— Horseman, Pass By (1961),* Leaving Cheyenne (1963), and The Last Picture Show (1966)— all set in the north Texas town of Thalia after World War II, are collected here for the first time. In this trilogy, McMurtry writes tragically of men and women trying to carve out an existence on the plains, where the forces of modernity challenge small- town American life. From a cattleranch rivalry that confirms McMurtry’s “full- blooded Western genius” (Publishers Weekly) to a love triangle involving a cowboy, his rancher boss and wife, and finally to the hardscrabble citizens of an oil- patch town trying to keep their only movie house alive, McMurtry captures the stark realities of the West like no one else. With a new introduction, Thalia emerges as an American classic that celebrates one of our greatest literary masters. *Just named in 2017 by Publishers Weekly the #1 Western novel worthy of rediscovery.",
    "isbn": "ISBN_13 9781631493768",
    "image_url": "http://books.google.com/books/content?id=lj1bDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "Pegasus Bridge",
    "author": "Stephen E. Ambrose",
    "description": "In the early morning hours of June 6, 1944, a small detachment of British airborne troops stormed the German defense forces and paved the way for the Allied invasion of Europe. Pegasus Bridge was the first engagement of D-Day, the turning point of World War II. This gripping account of it by acclaimed author Stephen Ambrose brings to life a daring mission so crucial that, had it been unsuccessful, the entire Normandy invasion might have failed. Ambrose traces each step of the preparations over many months to the minute-by-minute excitement of the hand-to-hand confrontations on the bridge. This is a story of heroism and cowardice, kindness and brutality -- the stuff of all great adventures.",
    "isbn": "ISBN_13 9781439126677",
    "image_url": "http://books.google.com/books/content?id=nsb4DQMKHv8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "Citizen Soldiers",
    "author": "Stephen E. Ambrose",
    "isbn": "ISBN_13 978147674025",
    "description": "From Stephen E. Ambrose, bestselling author of Band of Brothers and D-Day, the inspiring story of the ordinary men of the U.S. army in northwest Europe from the day after D-Day until the end of the bitterest days of World War II. In this riveting account, historian Stephen E. Ambrose continues where he left off in his #1 bestseller D-Day. Citizen Soldiers opens at 0001 hours, June 7, 1944, on the Normandy beaches, and ends at 0245 hours, May 7, 1945, with the allied victory. It is biography of the US Army in the European Theater of Operations, and Ambrose again follows the individual characters of this noble, brutal, and tragic war. From the high command down to the ordinary soldier, Ambrose draws on hundreds of interviews to re-create the war experience with startling clarity and immediacy. From the hedgerows of Normandy to the overrunning of Germany, Ambrose tells the real story of World War II from the perspective of the men and women who fought it.",
    "image_url": "http://books.google.com/books/content?id=ojd102U_99IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "Nothing Like It In the World",
    "author": "Stephen E. Ambrose",
    "isbn": "ISBN_13 9780743203173",
    "description": "Chronicles the race to finish the transcontinental railroad in the 1860s and the exploits, sacrifices, triumphs, and tragedies of the individuals who made it happen.",
    "image_url": "http://books.google.com/books/content?id=TZp_GT7PscIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "Palace of Treason",
    "author": "Jason Matthews",
    "description": "\"Captain Dominika Egorova of the Russian Intelligence Service (SVR) has returned from the West to Moscow. She despises the men she serves, the oligarchs, and crooks, and thugs of Putin’s Russia. What no one knows is that Dominika is working for the CIA as Washington’s most sensitive penetration of SVR and the Kremlin. As she expertly dodges exposure, Dominika deals with a murderously psychotic boss; survives an Iranian assassination attempt; escapes a counterintelligence ambush; rescues an arrested agent and exfiltrates him out of Russia; and has a chilling midnight conversation in her nightgown with President Putin. Complicating these risks is the fact that Dominika is in love with her CIA handler, Nate Nash, and their lust is as dangerous as committing espionage in Moscow. And when a mole in the SVR finds Dominika’s name on a restricted list of sources, it is a virtual death sentence ...\"--Amazon website.",
    "isbn": "ISBN_13 9781501135071",
    "image_url": "http://books.google.com/books/content?id=gkx5DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "title": "The Kremlin's Candidate",
    "author": "Jason Matthews",
    "description": "Red Sparrow is now a major motion picture starring Jennifer Lawrence and Joel Edgerton! In the final, thrilling New York Times bestselling installment of the Red Sparrow Trilogy, Russian counterintelligence chief Dominika Egorova and her lover, CIA agent Nate Nash, must find a Russian agent about to be appointed to a very high office in the US government. With a plot ripped from tomorrow’s headlines, Jason Matthews’s high-powered, seductive third novel not only continues the dangerous entanglements of Dominika and Nate but reveals with chilling authenticity how Russian espionage can place agents in the most sensitive positions of power. The novel opens with Russian president Vladimir Putin planning the covert assassination of a high-ranking US official with the intention of replacing him with a mole whom Russian intelligence has cultivated for more than fifteen years. Catching wind of this plot, Dominika, Nate, and their CIA colleagues must unmask the traitor before he or she is able to reveal that Dominika has been spying for years on behalf of the CIA. Any leak, any misstep, will expose her as a CIA asset and result in a one-way trip to a Moscow execution cellar. Along the way, Matthews, a thirty-three-year veteran of the CIA and winner of the Edgar Award for Best First Novel, sets vivid, unforgettable scenes in Moscow; Washington, DC; Hong Kong; New York; the Sudan; and Turkey, and introduces two cold-blooded killers: Iosip Blokhin, a brilliant Spetsnaz military officer, and Grace Gao, ravishing Chinese spy, master of Kundalini yoga, and Beijing-trained seductress. Ultimately, the lines of danger converge on the spectacular billion-dollar presidential palace on the Black Sea during a power weekend with Putin’s inner circle. Does Nate sacrifice himself to save Dominika? Does she forfeit herself to protect Nate? Do they go down together? This dazzling finale to Jason Matthews’s New York Times bestselling Red Sparrow Trilogy, called “a primer in twenty-first-century spying...terrifically good” (The New York Times Book Review), confirms the critical acclaim he received for the first two novels, praise that compared Matthews to John le Carré and Ian Fleming.",
    "isbn": "ISBN_13 9781501140105",
    "image_url": "http://books.google.com/books/content?id=wziMDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  }
]